
BEGIN;

insert into
  cinema (
    cinema_name,
    cinema_desc,
    cinema_path,
    cinema_duration,
    cinema_start_date,
    cinema_end_date,
    type_type_id,
    age_age_id
  )
values
  (
    'Бэтмен',
    'После двух лет поисков правосудия на улицах Готэма Бэтмен становится для горожан олицетворением беспощадного возмездия. Когда в городе происходит серия жестоких нападений на высокопоставленных чиновников, улики приводят Брюса Уэйна в самые тёмные закоулки преступного мира, где он встречает Женщину-Кошку, Пингвина, Кармайна Фальконе и Загадочника. Теперь под прицелом оказывается сам Бэтмен, которому предстоит отличить друга от врага и восстановить справедливость во имя Готэма.',
    'betmen.png',
    118,
    '2024-10-23',
    '2025-03-12',
    1,
    6
  );

insert into
  cinema (
    cinema_name,
    cinema_desc,
    cinema_path,
    cinema_duration,
    cinema_start_date,
    cinema_end_date,
    type_type_id,
    age_age_id
  )
values
  (
    'Человек-паук',
    'Питер Паркер – обыкновенный школьник. Однажды он отправился с классом на экскурсию, где его кусает странный паук-мутант. Через время парень почувствовал в себе нечеловеческую силу и ловкость в движении, а главное – умение лазать по стенам и метать стальную паутину. Свои способности он направляет на защиту слабых. Так Питер становится настоящим супергероем по имени Человек-паук, который помогает людям и борется с преступностью. Но там, где есть супергерой, рано или поздно всегда объявляется и суперзлодей...',
    'spiderman.png',
    118,
    '2024-10-23',
    '2025-03-12',
    1,
    3
  );

insert into
  cinema (
    cinema_name,
    cinema_desc,
    cinema_path,
    cinema_duration,
    cinema_start_date,
    cinema_end_date,
    type_type_id,
    age_age_id
  )
values
  (
    'Марио',
    'Братья-водопроводчики Марио и Луиджи открывают портал в подземный город, из которого должны вызволить пленённую принцессу Пич и сразиться с заклятым врагом Боузером.',
    'mario.png',
    92,
    '2024-10-23',
    '2025-04-05',
    2,
    1
  );

insert into
  cinema (
    cinema_name,
    cinema_desc,
    cinema_path,
    cinema_duration,
    cinema_start_date,
    cinema_end_date,
    type_type_id,
    age_age_id
  )
values
  (
    'Капитан Марвел',
    'После столкновения с враждующими инопланетными расами пилот военно-воздушных сил Кэрол Дэнверс обретает суперсилу и становится неуязвимой. Ей предстоит совладать со своими новыми способностями, чтобы противостоять могущественному врагу.',
    'woman.png',
    123,
    '2024-10-23',
    '2025-04-05',
    1,
    7
  );

insert into
  cinema (
    cinema_name,
    cinema_desc,
    cinema_path,
    cinema_duration,
    cinema_start_date,
    cinema_end_date,
    type_type_id,
    age_age_id
  )
values
  (
    'Джокер',
    'Готэм, начало 1980-х годов. Комик Артур Флек живет с больной матерью, которая с детства учит его «ходить с улыбкой». Пытаясь нести в мир хорошее и дарить людям радость, Артур сталкивается с человеческой жестокостью и постепенно приходит к выводу, что этот мир получит от него не добрую улыбку, а ухмылку злодея Джокера.',
    'joker.png',
    122,
    '2024-10-23',
    '2025-04-05',
    1,
    7
  );

insert into
  cinema (
    cinema_name,
    cinema_desc,
    cinema_path,
    cinema_duration,
    cinema_start_date,
    cinema_end_date,
    type_type_id,
    age_age_id
  )
values
  (
    'Властелин Колец 2',
    'Повелитель сил тьмы Саурон направляет свою бесчисленную армию под стены Минас-Тирита, крепости Последней Надежды. Он предвкушает близкую победу, но именно это мешает ему заметить две крохотные фигурки — хоббитов, приближающихся к Роковой Горе, где им предстоит уничтожить Кольцо Всевластья.',
    'rings.png',
    201,
    '2024-10-23',
    '2025-04-05',
    1,
    3
  );

insert into
  cinema (
    cinema_name,
    cinema_desc,
    cinema_path,
    cinema_duration,
    cinema_start_date,
    cinema_end_date,
    type_type_id,
    age_age_id
  )
values
  (
    'Шрек Навсегда',
    'Под грузом воспоминаний о днях, когда он чувствовал себя «настоящим огром», Шрэк поддается на уговоры сладкоголосого Румпельштильцхена и заключает с ним договор. Сразу после этого Шрэк оказывается в альтернативной реальности Тридевятого королевства, где все поставлено с ног на голову: на огров здесь охотятся, Румпельштильцхен восседает на троне, а Шрэк и Фиона даже не знакомы. ',
    'shrek.png',
    90,
    '2024-10-23',
    '2025-04-05',
    2,
    7
  );

insert into
  cinema (
    cinema_name,
    cinema_desc,
    cinema_path,
    cinema_duration,
    cinema_start_date,
    cinema_end_date,
    type_type_id,
    age_age_id
  )
values
  (
    'Черепашки-ниндзя',
    'Четверо братьев-черепах, всю жизнь скрывавшихся от мира людей в канализациях Нью-Йорка и обучавшихся ниндзюцу, отправляются на поверхность и пытаются жить как нормальные подростки. С помощью своей новой подруги Эйприл О’Нил они выходят на след печально известного преступного синдиката и армии мутантов.',
    'turtles.png',
    99,
    '2024-10-23',
    '2025-04-05',
    2,
    4
  );

insert into
  cinema (
    cinema_name,
    cinema_desc,
    cinema_path,
    cinema_duration,
    cinema_start_date,
    type_type_id,
    age_age_id
  )
values
  (
    'Укрытие',
    'Измученный апокалиптическими видениями мужчина пытается понять, защищать ему свою семью от приближающегося шторма или от самого себя.',
    'ukrytie-silo.png',
    121,
    '2024-10-23',
    1,
    7
  );

insert into
  cinema (
    cinema_name,
    cinema_desc,
    cinema_path,
    cinema_duration,
    cinema_start_date,
    cinema_end_date,
    type_type_id,
    age_age_id
  )
values
  (
    'Человек на Луне',
    'История одной из важнейших космических миссий ХХ века – высадки человека на Луну, – показанная глазами астронавта Нила Армстронга. Какую цену ему и всей Америке пришлось заплатить за эту экспедицию?',
    'vkosmose.png',
    140,
    '2024-10-23',
    '2025-04-05',
    1,
    7
  );

insert into
  cinema (
    cinema_name,
    cinema_desc,
    cinema_path,
    cinema_duration,
    cinema_start_date,
    cinema_end_date,
    type_type_id,
    age_age_id
  )
values
  (
    'Русалочка',
    'Русалочку Ариэль, одну из дочерей морского царя Тритона, ужасно интересует человечество. Несмотря на неодобрение отца, она поднимается к поверхности и спасает попавшего в кораблекрушение принца Эрика. Узнав об этом, Тритон приходит в ярость и навсегда запрещает дочери покидать морское дно — этим и решает воспользоваться морская ведьма Урсула. В обмен на голос она даёт Ариэль ноги, но у девушки есть только три дня: если к закату третьего дня она не разделит с Эриком поцелуй настоящей любви, то навсегда попадёт в собственность ведьмы.',
    'rusalochka.png',
    135,
    '2024-10-23',
    '2025-04-05',
    1,
    4
  );

insert into
  cinema (
    cinema_name,
    cinema_desc,
    cinema_path,
    cinema_duration,
    cinema_start_date,
    cinema_end_date,
    type_type_id,
    age_age_id
  )
values
  (
    'Хищные птицы',
    'Харли Квинн рассталась с Джокером и через некоторое время сообщила об этом всему Готэму, взорвав тот самый химзавод. Девушка больше не тоскует по несостоявшимся отношениям — ей некогда, так как она также потеряла неприкосновенность, и теперь за ней охотятся разной степени криминализованности граждане, желающие отомстить. А в это время ставший крёстным отцом Готема Роман Сайонис очень жаждет вернуть пропавший бриллиант, который стащила у его подручного малолетняя карманница.',
    'Suicide_Squad.png',
    109,
    '2024-10-23',
    '2025-04-05',
    1,
    7
  );

insert into
  cinema (
    cinema_name,
    cinema_desc,
    cinema_path,
    cinema_duration,
    cinema_start_date,
    cinema_end_date,
    type_type_id,
    age_age_id
  )
values
  (
    'Аватар: Путь воды',
    'После принятия образа аватара солдат Джейк Салли становится предводителем народа нави и берет на себя миссию по защите новых друзей от корыстных бизнесменов с Земли. Теперь ему есть за кого бороться — с Джейком его прекрасная возлюбленная Нейтири. Когда на Пандору возвращаются до зубов вооруженные земляне, Джейк готов дать им отпор.',
    'avatar.png',
    192,
    '2024-11-02',
    '2025-04-05',
    1,
    4
  );

insert into
  cinema (
    cinema_name,
    cinema_desc,
    cinema_path,
    cinema_duration,
    cinema_start_date,
    cinema_end_date,
    type_type_id,
    age_age_id
  )
values
  (
    'Пушистые мошенники',
    'Бельгийский остроумный мультфильм про двух лесных супергероев — бельчонка Тьюма и ежиху Латте. Когда в их родной лес приходит беда и начинается засуха, они вызываются спасти сородичей от верной гибели. Им предстоит совершить опасное путешествие и добыть главный магический артефакт этого мира — бриллиант, который хранит король медведей. Только он может вызвать ливень и помочь животным не умереть от жажды.',
    'zveropoi-sing-movie-gitara.png',
    81,
    '2024-11-02',
    '2025-04-05',
    2,
    2
  );

insert into
  cinema (
    cinema_name,
    cinema_desc,
    cinema_path,
    cinema_duration,
    cinema_start_date,
    cinema_end_date,
    type_type_id,
    age_age_id
  )
values
  (
    'Монстры завоеватели',
    'Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Проектах семь имеет курсивных сих родного?',
    'Monsters_Alien.png',
    150,
    '2024-11-02',
    '2025-04-05',
    1,
    7
  );

insert into
  cinema (
    cinema_name,
    cinema_desc,
    cinema_path,
    cinema_duration,
    cinema_start_date,
    cinema_end_date,
    type_type_id,
    age_age_id
  )
values
  (
    'Штурмовая винтовка',
    'Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Проектах семь имеет курсивных сих родного?',
    'Assault_rifle_Two.png',
    170,
    '2024-10-23',
    '2025-04-05',
    1,
    7
  );

insert into
  cinema (
    cinema_name,
    cinema_desc,
    cinema_path,
    cinema_duration,
    cinema_start_date,
    cinema_end_date,
    type_type_id,
    age_age_id
  )
values
  (
    'Мастер и Маргарита',
    'Москва, 1930-е годы. Популярный драматург обвиняется в антисоветчине: спектакль по его пьесе отменяют, а самого его выгоняют из союза литераторов. В не самый лучший момент своей жизни он встречает глубоко несчастную в браке красавицу Маргариту и начинает новый роман, героями которого становятся люди из его окружения, в том числе — мистический персонаж Воланд, списанный со знакомого иностранца.',
    'master.png',
    157,
    '2024-10-23',
    '2025-04-05',
    1,
    7
  );

insert into
  cinema (
    cinema_name,
    cinema_desc,
    cinema_path,
    cinema_duration,
    cinema_start_date,
    cinema_end_date,
    type_type_id,
    age_age_id
  )
values
  (
    'Сто лет тому вперед',
    'Они живут в разных мирах. Коля Герасимов — в сегодняшней Москве, Алиса Селезнева — на сто лет позже. Коля — обычный парень, ему нет дела до будущего. Алису не отпускает прошлое: она пытается найти маму, которую потеряла, когда была совсем ребенком. Встреча Алисы и Коли станет началом невероятных приключений, в которых им предстоит отвоевать у космических пиратов Вселенную, восстановить ход времени и обрести самое дорогое: любовь и дружбу.',
    '100.png',
    157,
    '2024-10-23',
    '2025-04-05',
    1,
    2
  );

insert into
  cinema (
    cinema_name,
    cinema_desc,
    cinema_path,
    cinema_duration,
    cinema_start_date,
    cinema_end_date,
    type_type_id,
    age_age_id
  )
values
  (
    'Сердитые птички',
    'На тропическом острове, где живут нелетающие птицы, царит атмосфера радости и счастья. Красная птица Ред с самого детства чувствовал себя изгоем, поэтому ничего удивительного, что теперь он не вписывается в окружающую действительность и не разделяет всеобщего оптимизма. Однажды на райский остров прибывают зелёные свиньи, и дружелюбные птицы устраивают им радушный приём, но кроме Реда никто не замечает, что свиньи задумали подлость.',
    'angry-birds.png',
    97,
    '2024-10-23',
    '2025-04-05',
    2,
    2
  );

insert into
  cinema (
    cinema_name,
    cinema_desc,
    cinema_path,
    cinema_duration,
    cinema_start_date,
    cinema_end_date,
    type_type_id,
    age_age_id
  )
values
  (
    'Путешествие медведей',
    'Не рыбачьте там, где ловят рыбу медведи. Если вы увидели медведя, а он вас не видит, спокойно уходите. Если медведь вас увидел, но не учуял, обозначьте себя шумом и приготовьте фальшвеер или газовый баллон. Медведи в большинстве своем звери любопытные. Если медведь подошел близко, надо шуметь и изображать свои решительные намерения, но не агрессивность. Никогда не рычать! ',
    'Brown_Bears.png',
    127,
    '2024-10-23',
    '2025-04-05',
    1,
    2
  );

end;